#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/joshuayeungzuhlke/openapi-petstore-devops/runs/run-EMHUu8k7XGmU4kpq

Waiting for the plan to start...

Terraform v1.3.3
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.eks: Reading...
random_string.suffix: Refreshing state... [id=o6Y8YpAD]
data.terraform_remote_state.eks: Read complete after 0s
data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0fe548d68b7ee1754]
module.eks-cluster-autoscaler.data.aws_region.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/education-eks-o6Y8YpAD/cluster]
module.eks-cluster-autoscaler.data.aws_iam_policy_document.this[0]: Reading...
module.eks.data.aws_default_tags.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks-cluster-autoscaler.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.eks.data.aws_default_tags.current: Read complete after 0s [id=aws]
module.eks.data.aws_caller_identity.current: Reading...
module.eks-cluster-autoscaler.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4028248277]
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=education-eks-o6Y8YpAD-cluster-20221102030909477900000001]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=502648746362]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=502648746362]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a2d53175e3bc27b2]
aws_security_group.node_group_one: Refreshing state... [id=sg-03243343fbef6ff8b]
aws_security_group.node_group_two: Refreshing state... [id=sg-02c73c715151b0cf9]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-07b46ffcc991ec153]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07690aad2e2055f32]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0862d9b5448499003]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07ad148ea4b556806]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0150b92582a1c44b9]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-02ae773fc9eaed5a6]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-083dbc387361998b8]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0faee4976ff2d2707]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0715ebe859bd9b099]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d253873c003f23a5]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=education-eks-o6Y8YpAD-cluster-20221102030909477900000001-20221102030910264900000002]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=education-eks-o6Y8YpAD-cluster-20221102030909477900000001-20221102030910285100000003]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04d4025464c3489c5]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0150b92582a1c44b91080289494]
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_caller_identity.current: Read complete after 0s [id=502648746362]
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_caller_identity.current: Read complete after 0s [id=502648746362]
module.eks.module.eks_managed_node_group["one"].module.user_data.data.cloudinit_config.linux_eks_managed_node_group[0]: Reading...
module.eks.module.eks_managed_node_group["two"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["two"].module.user_data.data.cloudinit_config.linux_eks_managed_node_group[0]: Reading...
module.eks.module.eks_managed_node_group["one"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f8b08b4716b2cbd9]
module.eks.module.eks_managed_node_group["one"].module.user_data.data.cloudinit_config.linux_eks_managed_node_group[0]: Read complete after 0s [id=329915227]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-047a96ca026f996d4]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0403fea512d88635d]
module.eks.module.eks_managed_node_group["two"].module.user_data.data.cloudinit_config.linux_eks_managed_node_group[0]: Read complete after 0s [id=329915227]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09b967aa9ffc719f0]
module.eks.module.eks_managed_node_group["one"].aws_iam_role.this[0]: Refreshing state... [id=node-group-1-eks-node-group-20221102030924652400000009]
module.eks.module.eks_managed_node_group["two"].aws_iam_role.this[0]: Refreshing state... [id=node-group-2-eks-node-group-20221102030924651700000008]
module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-3932491737]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-840503747]
module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-2366842649]
module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-2310561512]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4209195973]
module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-57976191]
module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-687359739]
module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-4146494437]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-345216338]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2521215532]
module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-2670292359]
module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-922301355]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2179151397]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-016dc2d38e5e71e7b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03d542d1ae5dbb742]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-07d2fee4cbbfc1c9c]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04d4025464c3489c51080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=education-eks-o6Y8YpAD]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-1-eks-node-group-20221102030924652400000009-2022110203092530750000000b]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-2-eks-node-group-20221102030924651700000008-2022110203092553650000000f]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-1-eks-node-group-20221102030924652400000009-2022110203092529970000000a]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-1-eks-node-group-20221102030924652400000009-2022110203092545040000000e]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-2-eks-node-group-20221102030924651700000008-2022110203092530980000000c]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-2-eks-node-group-20221102030924651700000008-2022110203092540130000000d]
module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0]: Refreshing state... [id=lt-0c1c897745cc92a3c]
module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0]: Refreshing state... [id=lt-00d5cb28309476d60]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=6aaaf249a00fb7c18cdfa8ea57cb414234237e2b]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::502648746362:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/770793046773E8AC6880A3F2435B9B98]
module.eks-cluster-autoscaler.data.aws_iam_policy_document.this_irsa[0]: Reading...
module.eks-cluster-autoscaler.data.aws_iam_policy_document.this_irsa[0]: Read complete after 0s [id=1988916631]
module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0]: Refreshing state... [id=education-eks-o6Y8YpAD:node-group-1-20221102031916732500000016]
module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0]: Refreshing state... [id=education-eks-o6Y8YpAD:node-group-2-20221102031916731900000014]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks-cluster-autoscaler.data.utils_deep_merge_yaml.values[0] will be read during apply
  # (config refers to values not yet known)
 <= data "utils_deep_merge_yaml" "values" {
      + id     = (known after apply)
      + input  = (known after apply)
      + output = (known after apply)
    }

  # module.eks-cluster-autoscaler.aws_iam_policy.this[0] will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Policy for cluster-autoscaler service"
      + id          = (known after apply)
      + name        = "cluster-autoscaler-irsa-cluster-autoscaler"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeInstanceTypes",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Autoscaling"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.eks-cluster-autoscaler.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-2.amazonaws.com/id/770793046773E8AC6880A3F2435B9B98:sub" = "system:serviceaccount:cluster-autoscaler:cluster-autoscaler"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::502648746362:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/770793046773E8AC6880A3F2435B9B98"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cluster-autoscaler-irsa-cluster-autoscaler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks-cluster-autoscaler.aws_iam_role_policy_attachment.this[0] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cluster-autoscaler-irsa-cluster-autoscaler"
    }

  # module.eks-cluster-autoscaler.helm_release.this[0] will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "cluster-autoscaler"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "9.19.1"
      + wait                       = false
      + wait_for_jobs              = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @joshuayeung, Action: `pull_request`*